results/iterations/nginx_2mb_latency_iter1.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   395.13us  334.01us   8.19ms   88.75%
    Req/Sec    40.16k    16.00k   79.46k    76.75%
  1598433 requests in 10.01s, 496.94MB read
  Non-2xx or 3xx responses: 1598433
Requests/sec: 159671.81
Transfer/sec:     49.64MB