results/iterations/nginx_2mb_latency_iter10.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   428.07us  401.36us   9.65ms   92.38%
    Req/Sec    39.06k    14.51k   73.78k    77.00%
  1554425 requests in 10.01s, 483.26MB read
  Non-2xx or 3xx responses: 1554425
Requests/sec: 155249.97
Transfer/sec:     48.27MB