results/iterations/nginx_2mb_latency_iter2.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   391.23us  298.52us   7.95ms   87.27%
    Req/Sec    39.86k    15.58k   77.85k    77.75%
  1586253 requests in 10.02s, 493.16MB read
  Non-2xx or 3xx responses: 1586253
Requests/sec: 158314.23
Transfer/sec:     49.22MB