results/iterations/nginx_2mb_latency_iter4.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   391.48us  305.54us   8.40ms   87.27%
    Req/Sec    39.95k    15.69k   76.35k    77.25%
  1589870 requests in 10.01s, 494.28MB read
  Non-2xx or 3xx responses: 1589870
Requests/sec: 158767.73
Transfer/sec:     49.36MB