results/iterations/nginx_2mb_latency_iter5.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   434.29us  411.98us  12.92ms   93.21%
    Req/Sec    37.68k    14.42k   72.49k    79.50%
  1499374 requests in 10.01s, 466.15MB read
  Non-2xx or 3xx responses: 1499374
Requests/sec: 149826.48
Transfer/sec:     46.58MB