results/iterations/nginx_2mb_latency_iter7.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   391.17us  279.62us   5.84ms   85.66%
    Req/Sec    39.84k    15.71k   81.75k    77.25%
  1584815 requests in 10.01s, 492.71MB read
  Non-2xx or 3xx responses: 1584815
Requests/sec: 158343.90
Transfer/sec:     49.23MB