results/iterations/nginx_2mb_latency_iter8.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   399.25us  320.80us   9.08ms   87.98%
    Req/Sec    39.07k    15.19k   78.12k    78.75%
  1554359 requests in 10.01s, 483.24MB read
  Non-2xx or 3xx responses: 1554359
Requests/sec: 155342.65
Transfer/sec:     48.29MB