results/iterations/nginx_2mb_latency_iter9.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   388.28us  332.63us   9.86ms   89.08%
    Req/Sec    40.65k    16.23k   85.53k    76.25%
  1617818 requests in 10.01s, 502.97MB read
  Non-2xx or 3xx responses: 1617818
Requests/sec: 161579.65
Transfer/sec:     50.23MB