results/iterations/nginx_4kb_latency_iter10.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   419.33us  416.80us  11.52ms   93.21%
    Req/Sec    39.56k    15.82k   79.45k    77.25%
  1574522 requests in 10.02s, 489.51MB read
  Non-2xx or 3xx responses: 1574522
Requests/sec: 157155.73
Transfer/sec:     48.86MB