results/iterations/nginx_4kb_latency_iter2.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   364.90us  293.67us   7.95ms   88.17%
    Req/Sec    43.16k    17.42k   80.29k    70.25%
  1717141 requests in 10.01s, 533.85MB read
  Non-2xx or 3xx responses: 1717141
Requests/sec: 171625.44
Transfer/sec:     53.36MB