results/iterations/nginx_4kb_latency_iter4.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   469.71us  527.13us  15.45ms   93.90%
    Req/Sec    38.99k    15.68k   79.13k    75.50%
  1551723 requests in 10.02s, 482.42MB read
  Non-2xx or 3xx responses: 1551723
Requests/sec: 154903.82
Transfer/sec:     48.16MB