results/iterations/nginx_4kb_latency_iter7.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   408.54us  444.92us  14.92ms   93.57%
    Req/Sec    42.73k    16.70k   79.67k    70.50%
  1700201 requests in 10.01s, 528.58MB read
  Non-2xx or 3xx responses: 1700201
Requests/sec: 169787.42
Transfer/sec:     52.79MB