results/iterations/nginx_4kb_latency_iter8.txt
Running 10s test @ http://localhost/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   354.38us  308.10us   8.11ms   89.50%
    Req/Sec    44.55k    17.94k   80.10k    67.25%
  1772878 requests in 10.01s, 551.18MB read
  Non-2xx or 3xx responses: 1772878
Requests/sec: 177159.36
Transfer/sec:     55.08MB