results/iterations/redis_2mb_latency_iter1.txt
====== SET ======
  1000000 requests completed in 11.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.295 milliseconds (cumulative count 736734)
75.000% <= 0.303 milliseconds (cumulative count 878539)
93.750% <= 0.311 milliseconds (cumulative count 939071)
96.875% <= 0.327 milliseconds (cumulative count 982186)
98.438% <= 0.335 milliseconds (cumulative count 989982)
99.219% <= 0.343 milliseconds (cumulative count 993269)
99.609% <= 0.367 milliseconds (cumulative count 996356)
99.805% <= 0.399 milliseconds (cumulative count 998151)
99.902% <= 0.583 milliseconds (cumulative count 999085)
99.951% <= 0.599 milliseconds (cumulative count 999602)
99.976% <= 0.615 milliseconds (cumulative count 999774)
99.988% <= 0.663 milliseconds (cumulative count 999878)
99.994% <= 1.031 milliseconds (cumulative count 999939)
99.997% <= 8.839 milliseconds (cumulative count 999970)
99.998% <= 9.127 milliseconds (cumulative count 999985)
99.999% <= 9.271 milliseconds (cumulative count 999993)
100.000% <= 9.351 milliseconds (cumulative count 999997)
100.000% <= 9.391 milliseconds (cumulative count 999999)
100.000% <= 9.415 milliseconds (cumulative count 1000000)
100.000% <= 9.415 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 30)
87.854% <= 0.303 milliseconds (cumulative count 878539)
99.825% <= 0.407 milliseconds (cumulative count 998252)
99.868% <= 0.503 milliseconds (cumulative count 998680)
99.971% <= 0.607 milliseconds (cumulative count 999707)
99.989% <= 0.703 milliseconds (cumulative count 999891)
99.991% <= 0.807 milliseconds (cumulative count 999914)
99.993% <= 0.903 milliseconds (cumulative count 999933)
99.994% <= 1.007 milliseconds (cumulative count 999938)
99.995% <= 1.103 milliseconds (cumulative count 999945)
99.995% <= 1.207 milliseconds (cumulative count 999949)
99.995% <= 1.303 milliseconds (cumulative count 999950)
99.998% <= 9.103 milliseconds (cumulative count 999983)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88191.20 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.290     0.104     0.295     0.319     0.343     9.415
====== GET ======
  1000000 requests completed in 11.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 3)
50.000% <= 0.295 milliseconds (cumulative count 595928)
75.000% <= 0.311 milliseconds (cumulative count 830686)
87.500% <= 0.327 milliseconds (cumulative count 897828)
93.750% <= 0.367 milliseconds (cumulative count 940681)
96.875% <= 0.423 milliseconds (cumulative count 971468)
98.438% <= 0.463 milliseconds (cumulative count 985774)
99.219% <= 0.519 milliseconds (cumulative count 992289)
99.609% <= 0.591 milliseconds (cumulative count 996407)
99.805% <= 0.631 milliseconds (cumulative count 998059)
99.902% <= 0.719 milliseconds (cumulative count 999034)
99.951% <= 0.815 milliseconds (cumulative count 999536)
99.976% <= 0.951 milliseconds (cumulative count 999758)
99.988% <= 1.135 milliseconds (cumulative count 999878)
99.994% <= 1.375 milliseconds (cumulative count 999939)
99.997% <= 1.607 milliseconds (cumulative count 999970)
99.998% <= 1.871 milliseconds (cumulative count 999985)
99.999% <= 2.231 milliseconds (cumulative count 999993)
100.000% <= 2.399 milliseconds (cumulative count 999997)
100.000% <= 2.479 milliseconds (cumulative count 999999)
100.000% <= 2.535 milliseconds (cumulative count 1000000)
100.000% <= 2.535 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 25)
74.602% <= 0.303 milliseconds (cumulative count 746019)
96.212% <= 0.407 milliseconds (cumulative count 962123)
99.120% <= 0.503 milliseconds (cumulative count 991199)
99.721% <= 0.607 milliseconds (cumulative count 997205)
99.892% <= 0.703 milliseconds (cumulative count 998919)
99.950% <= 0.807 milliseconds (cumulative count 999501)
99.971% <= 0.903 milliseconds (cumulative count 999714)
99.980% <= 1.007 milliseconds (cumulative count 999803)
99.987% <= 1.103 milliseconds (cumulative count 999867)
99.990% <= 1.207 milliseconds (cumulative count 999899)
99.993% <= 1.303 milliseconds (cumulative count 999926)
99.994% <= 1.407 milliseconds (cumulative count 999944)
99.996% <= 1.503 milliseconds (cumulative count 999958)
99.997% <= 1.607 milliseconds (cumulative count 999970)
99.998% <= 1.703 milliseconds (cumulative count 999979)
99.998% <= 1.807 milliseconds (cumulative count 999983)
99.999% <= 1.903 milliseconds (cumulative count 999985)
99.999% <= 2.007 milliseconds (cumulative count 999988)
99.999% <= 2.103 milliseconds (cumulative count 999990)
100.000% <= 3.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 84688.35 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.303     0.120     0.295     0.391     0.495     2.535